Lee878-st/STM32H750-Decode-FLAC/User/sai/bsp_sai.h
#ifndef _BSP_SAI_H
#define	_BSP_SAI_H


#include "stm32h7xx.h"
#include "./usart/bsp_debug_usart.h"
#include "./delay/core_delay.h"

/**SAI1_A_Block_A GPIO Configuration    
  PE5     ------>       SAI1_SCK_A
  PE4     ------>       SAI1_FS_A
  PE6     ------>       SAI1_SD_A
  PE3     ------>       SAI1_SD_B
  PE2     ------>       SAI1_MCLK_A
*/
#define SAI_LRC_PIN                  GPIO_PIN_4                 
#define SAI_LRC_PORT                 GPIOE                     
#define SAI_LRC_GPIO_CLK_ENABLE()    __GPIOE_CLK_ENABLE()
#define SAI_LRC_GPIO_AF              GPIO_AF6_SAI1

#define SAI_BCLK_PIN                  GPIO_PIN_5                 
#define SAI_BCLK_PORT                 GPIOE                     
#define SAI_BCLK_GPIO_CLK_ENABLE()    __GPIOE_CLK_ENABLE()
#define SAI_BCLK_GPIO_AF              GPIO_AF6_SAI1

#define SAI_SDA_PIN                  GPIO_PIN_6                 
#define SAI_SDA_PORT                 GPIOE                     
#define SAI_SDA_GPIO_CLK_ENABLE()    __GPIOE_CLK_ENABLE()
#define SAI_SDA_GPIO_AF              GPIO_AF6_SAI1

#define SAI_SDB_PIN                  GPIO_PIN_3                 
#define SAI_SDB_PORT                 GPIOE                     
#define SAI_SDB_GPIO_CLK_ENABLE()    __GPIOE_CLK_ENABLE()
#define SAI_SDB_GPIO_AF              GPIO_AF6_SAI1

#define SAI_MCLK_PIN                  GPIO_PIN_2                 
#define SAI_MCLK_PORT                 GPIOE                     
#define SAI_MCLK_GPIO_CLK_ENABLE()    __GPIOE_CLK_ENABLE()
#define SAI_MCLK_GPIO_AF              GPIO_AF6_SAI1

/* SAI1相关定义 */
#define SAIx_Block_A                  SAI1_Block_A
#define SAI_CLK_ENABLE()              __HAL_RCC_SAI1_CLK_ENABLE();

#define SAI1_TX_DMASx                  DMA2_Stream3
#define SAI1_TX_DMASx_Channel          DMA_CHANNEL_0
#define SAI1_TX_DMASx_IRQHandler       DMA2_Stream3_IRQHandler
#define SAI1_TX_DMASx_IRQ              DMA2_Stream3_IRQn
#define SAI1_TX_DMASx_FLAG             DMA_FLAG_TCIF3_7
#define SAI1_TX_DMA_CLK_ENABLE()       do{ __HAL_RCC_DMA2_CLK_ENABLE(); }while(0)    /* SAIA TX DMA时钟使能 */

extern SAI_HandleTypeDef g_sai1_a_handle;         /* SAI1 Block A句柄 */

extern void (*sai1_tx_callback)(void);            /* sai tx回调函数指针 */

void sai1_saia_init(uint32_t mode,uint32_t cpol, uint32_t datalen);
uint8_t sai1_samplerate_set(uint32_t samplerate);
void sai1_tx_dma_init(uint8_t *buf0, uint8_t *buf1, uint16_t num, uint8_t width);
void sai1_saia_dma_enable(void);
void sai1_play_start(void); 
void sai1_play_stop(void); 




#endif /* _BSP_SAI_H */






